import { a as a } from "./preact.3d326435.js";
import { L as l, A as s } from "./index.659fabbf.js";
import { P as n } from "./Panel.693a3a8d.js";
import { s as o } from "./signature.7ef6ac6e.js";
let e = "B1lfb",
  r = "B1lcv",
  t = "B1lem",
  i = "B1l2rt",
  u = "B1l1l1",
  x = "B1l2sq",
  p = "B1l2y0",
  c = {
    jobs: "B1lfb",
    reasons: "B1lcv",
    about: "B1lem",
    aboutTitle: "B1l2rt",
    reasonsTitle: "B1l1l1",
    signature: "B1l2sq",
    ui: "B1l2y0",
  };
var m = c;
function d(e) {
  let r = (l, n) =>
    a(
      s,
      {
        source: "about",
        os: "ios" === l ? "iOS" : "Android",
        eventProperties: {
          Via: "jobs page",
          "App store": "ios" === l ? "App Store" : "Google Play",
        },
      },
      n
    );
  return a(
    n,
    { title: "╨á╨░╨▒╨╛╤é╨░ ╨▓ Songsterr", id: e.id },
    a(
      "div",
      { className: m.jobs },
      a(
        "div",
        { className: m.about },
        a(
          "p",
          null,
          "╨ó╤Ç╨╕╨╜╨░╨┤╤å╨░╤é╤î ╨╗╨╡╤é ╨╜╨░╨╖╨░╨┤ ╨╝╤ï\xa0╨┐╨╛╤ü╤é╨░╨▓╨╕╨╗╨╕ ╤å╨╡╨╗╤î\xa0ΓÇö ╨┤╨░╤é╤î ╨╗╤Ä╨┤╤Å╨╝ ╨┤╨╡╨╣╤ü╤é╨▓╨╕╤é╨╡╨╗╤î╨╜╨╛ ╤ì╤ä╤ä╨╡╨║╤é╨╕╨▓╨╜╤ï╨╣ ╤ü╨┐╨╛╤ü╨╛╨▒ ╤Ç╨░╨╖╤â╤ç╨╕╨▓╨░╨╜╨╕╤Å ╨╗╤Ä╨▒╨╕╨╝╤ï╤à ╨┐╨╡╤ü╨╡╨╜. ╨£╤ï\xa0╤ü\xa0╨╜╤â╨╗╤Å ╤ü╨╛╨╖╨┤╨░╨╗╨╕ ",
          a(l, { to: "/a/wa/about" }, "╨┐╤Ç╨╛╨┤╤â╨║╤é"),
          ", ╨║╨╛╤é╨╛╤Ç╤ï╨╝ ╤ü╨╡╨│╨╛╨┤╨╜╤Å ╨┐╨╛╨╗╤î╨╖╤â╤Ä╤é╤ü╤Å ╨╝╨╕╨╗╨╗╨╕╨╛╨╜╤ï ╨╗╤Ä╨┤╨╡╨╣ ╨┐╨╛\xa0╨▓╤ü╨╡╨╝╤â ╨╝╨╕╤Ç╤â. ╨¥╨░╤ê╨╕ ",
          r("ios", "iOS"),
          "\xa0╨╕\xa0",
          r("android", "Android"),
          " ╨┐╤Ç╨╕╨╗╨╛╨╢╨╡╨╜╨╕╤Å ╤ü╤é╨░╨▒╨╕╨╗╤î╨╜╨╛ ╨┤╨╡╤Ç╨╢╨░╤é╤ü╤Å ╨▓\xa0╤é╨╛╨┐╨╡ ╨╗╤â╤ç╤ê╨╕╤à ╨┐╤Ç╨╕╨╗╨╛╨╢╨╡╨╜╨╕╨╣ App\xa0Store ╨╕\xa0Google\xa0Play. ╨₧\xa0╨╜╨░╤ü ╨┐╨╕╤ü╨░╨╗╨╕ Techcrunch, Mashable, Lifehacker ╨╕\xa0The\xa0Wall\xa0Street\xa0Journal."
        ),
        a(
          "p",
          null,
          "╨ò╤ü╨╗╨╕ ╨▓╤ï ╤à╨╛╤é╨╕╤é╨╡ ╤Ç╨░╨▒╨╛╤é╨░╤é╤î ╨▓ ╨╜╨░╤ê╨╡╨╣ ╨║╨╛╨╝╨░╨╜╨┤╨╡, ╤é╨╛ ╨┐╨╕╤ê╨╕╤é╨╡ ╨╜╨░ ",
          a("a", { href: "mailto:hq@songsterr.com" }, "hq@songsterr.com"),
          ". ╨¥╨░╨╝ ╨╜╤â╨╢╨╜╤ï ",
          a(
            "b",
            {},
            "iOS, Android ╨╕ JavaScript ╤Ç╨░╨╖╤Ç╨░╨▒╨╛╤é╤ç╨╕╨║╨╕ ╤â╤Ç╨╛╨▓╨╜╤Å Senior"
          ),
          ". ╨û╨┤╨╡╨╝ ╤Ç╨╡╨╖╤Ä╨╝╨╡ ╨╕ ╨┐╤Ç╨╕╨╝╨╡╤Ç╤ï ╨║╨╛╨┤╨░. ╨ó╨░╨║╨╢╨╡ ╨╕╤ë╨╡╨╝ ",
          a("b", {}, "╤é╨╡╤ü╤é╨╕╤Ç╨╛╨▓╤ë╨╕╨║╨╛╨▓"),
          " ╨┤╨╗╤Å ╨┐╤Ç╨╛╨╡╨║╤é╨╛╨▓ ╤ü ╤ç╨░╤ü╤é╨╕╤ç╨╜╨╛╨╣ ╨╖╨░╨╜╤Å╤é╨╛╤ü╤é╤î╤Ä."
        )
      ),
      a(
        "div",
        { className: m.reasons },
        a(
          "h3",
          { className: m.reasonsTitle },
          "╨ƒ╤Ç╨╕╤ç╨╕╨╜╤ï ╤Ç╨░╨▒╨╛╤é╨░╤é╤î ╤ü ╨╜╨░╨╝╨╕"
        ),
        a(
          "ul",
          { className: m.ui },
          a(
            "li",
            null,
            a(
              "span",
              null,
              a(
                "strong",
                null,
                "╨ú╨┤╨░╨╗╨╡╨╜╨╜╨░╤Å ╤Ç╨░╨▒╨╛╤é╨░ ╤ü\xa0╨│╨╕╨▒╨║╨╕╨╝ ╨│╤Ç╨░╤ä╨╕╨║╨╛╨╝."
              ),
              " ╨¥╨░╨╝ ╨▓╨░╨╢╨╡╨╜ ╤é╨╛╨╗╤î╨║╨╛ ╤Ç╨╡╨╖╤â╨╗╤î╤é╨░╤é."
            )
          ),
          a(
            "li",
            null,
            a(
              "span",
              null,
              a(
                "strong",
                null,
                "╨₧╨┐╨╗╨░╤ç╨╕╨▓╨░╨╡╨╝╤ï╨╣ ╨╕╤ü╨┐╤ï╤é╨░╤é╨╡╨╗╤î╨╜╤ï╨╣ ╤ü╤Ç╨╛╨║ ╤ü\xa0╤ç╨░╤ü╤é╨╕╤ç╨╜╨╛╨╣ ╨╖╨░╨╜╤Å╤é╨╛╤ü╤é╤î╤Ä."
              ),
              " ╨Æ╤ï ╨╝╨╡╨╜╤Å╨╡╤é╨╡ ╤Ç╨░╨▒╨╛╤é╤â, ╤é╨╛╨╗╤î╨║╨╛ ╨╡╤ü╨╗╨╕ ╨▓╨░╨╝ ╨┤╨╡╨╣╤ü╤é╨▓╨╕╤é╨╡╨╗╤î╨╜╨╛ ╤â\xa0╨╜╨░╤ü ╨┐╨╛╨╜╤Ç╨░╨▓╨╕╤é╤ü╤Å. ╨¥╨╕╨║╨░╨║╨╕╤à ╤Ç╨╕╤ü╨║╨╛╨▓."
            )
          ),
          a(
            "li",
            null,
            a(
              "span",
              null,
              a(
                "strong",
                null,
                "╨£╨░╨╗╨╡╨╜╤î╨║╨░╤Å ╨║╨╛╨╝╨░╨╜╨┤╨░ ╤ü\xa0╨┐╨╗╨╛╤ü╨║╨╛╨╣ ╤ü╤é╤Ç╤â╨║╤é╤â╤Ç╨╛╨╣."
              ),
              " ╨Æ╨░╤ê ╨▓╨║╨╗╨░╨┤ ╨▒╤â╨┤╨╡╤é ╨╛╨│╤Ç╨╛╨╝╨╜╤ï╨╝."
            )
          ),
          a(
            "li",
            null,
            a(
              "span",
              null,
              a(
                "strong",
                null,
                "╨í╤é╨░╨▓╨║╨░ ╨╜╨░\xa0╤Ç╨╕╤ü╨║╨╛╨▓╨░╨╜╨╜╤ï╨╡ ╨╕╨╜╨╜╨╛╨▓╨░╤å╨╕╨╛╨╜╨╜╤ï╨╡ ╨╕╨┤╨╡╨╕."
              ),
              " ╨£╤ï\xa0╨┐╤ï╤é╨░╨╡╨╝╤ü╤Å ╨▓\xa0╨║╨╛╤Ç╨╜╨╡ ╨╕╨╖╨╝╨╡╨╜╨╕╤é╤î ╨┐╨╛╨┤╤à╨╛╨┤╤ï ╨║\xa0╨╛╨▒╤â╤ç╨╡╨╜╨╕╤Ä ╨╝╤â╨╖╤ï╨║╨╡."
            )
          ),
          a(
            "li",
            null,
            a(
              "span",
              null,
              a("strong", null, "╨í╤é╨░╨▒╨╕╨╗╤î╨╜╨╛╤ü╤é╤î."),
              " ╨£╤ï\xa0╤â╨╢╨╡ ╤é╤Ç╨╕╨╜╨░╨┤╤å╨░╤é╤î ╨╗╨╡╤é ╨╜╨░\xa0╤Ç╤ï╨╜╨║╨╡, ╤â╨▓╨╡╤Ç╨╡╨╜╨╜╨╛ ╨┐╤Ç╨╕╨▒╤ï╨╗╤î╨╜╤ï ╨╕\xa0╤Ç╨░╤ü╤é╨╡╨╝."
            )
          ),
          a(
            "li",
            null,
            a(
              "span",
              null,
              a("strong", null, "╨ú╨╜╨╕╨║╨░╨╗╤î╨╜╨░╤Å ╨░╤é╨╝╨╛╤ü╤ä╨╡╤Ç╨░."),
              " ╨Ü╤â╨╗╤î╤é╤â╤Ç╨╜╨░╤Å ╤ü╨╛╨▓╨╝╨╡╤ü╤é╨╕╨╝╨╛╤ü╤é╤î ╨┤╨╗╤Å ╨╜╨░╤ü ╨▓╨░╨╢╨╜╨░ ╨╜╨╡\xa0╨╝╨╡╨╜╤î╤ê╨╡, ╤ç╨╡╨╝ ╨┐╤Ç╨╛╨┤╤â╨║╤é╨╕╨▓╨╜╨╛╤ü╤é╤î."
            )
          ),
          a(
            "li",
            null,
            a(
              "span",
              null,
              a("strong", null, "╨ö╨╛╤ü╤é╨╛╨╣╨╜╨░╤Å ╨║╨╛╨╝╨┐╨╡╨╜╤ü╨░╤å╨╕╤Å."),
              " ╨£╤ï\xa0╨┐╤Ç╨╡╨┤╨╗╨░╨│╨░╨╡╨╝ ╨╛╨┐╤å╨╕╨╛╨╜, ╨╛╨┐╨╗╨░╤ç╨╕╨▓╨░╨╡╨╝ ╤é╨╡╤à╨╜╨╕╨║╤â, ╨┐╨╛╨╡╨╖╨┤╨║╨╕ ╨╜╨░\xa0╨║╨╛╨╜╤ä╨╡╤Ç╨╡╨╜╤å╨╕╨╕ ╨╕\xa0╨╖╨░╨╜╤Å╤é╨╕╤Å ╤ü╨┐╨╛╤Ç╤é╨╛╨╝."
            )
          )
        )
      ),
      a(
        "div",
        { className: m.signature },
        a("img", { src: o, width: 182, height: 53, alt: "Songsterr" })
      )
    )
  );
}
export { d as default };
